{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.1.2", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_18", "layers": [{"class_name": "Dense", "config": {"name": "dense_24", "trainable": true, "batch_input_shape": [null, 784], "dtype": "float32", "units": 4096, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_48", "trainable": true, "dtype": "float32", "activation": "tanh"}}, {"class_name": "Dense", "config": {"name": "dense_25", "trainable": true, "dtype": "float32", "units": 6272, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_v1_6", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_49", "trainable": true, "dtype": "float32", "activation": "tanh"}}, {"class_name": "Reshape", "config": {"name": "reshape_12", "trainable": true, "batch_input_shape": [null, 6272], "dtype": "float32", "target_shape": [7, 7, 128]}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_12", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_24", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_50", "trainable": true, "dtype": "float32", "activation": "tanh"}}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_13", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_25", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_51", "trainable": true, "dtype": "float32", "activation": "tanh"}}]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.001, "decay": 0.0, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}, "loss": "binary_crossentropy", "metrics": [], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of28.bin", "group1-shard2of28.bin", "group1-shard3of28.bin", "group1-shard4of28.bin", "group1-shard5of28.bin", "group1-shard6of28.bin", "group1-shard7of28.bin", "group1-shard8of28.bin", "group1-shard9of28.bin", "group1-shard10of28.bin", "group1-shard11of28.bin", "group1-shard12of28.bin", "group1-shard13of28.bin", "group1-shard14of28.bin", "group1-shard15of28.bin", "group1-shard16of28.bin", "group1-shard17of28.bin", "group1-shard18of28.bin", "group1-shard19of28.bin", "group1-shard20of28.bin", "group1-shard21of28.bin", "group1-shard22of28.bin", "group1-shard23of28.bin", "group1-shard24of28.bin", "group1-shard25of28.bin", "group1-shard26of28.bin", "group1-shard27of28.bin", "group1-shard28of28.bin"], "weights": [{"name": "batch_normalization_v1_6/gamma", "shape": [6272], "dtype": "float32"}, {"name": "batch_normalization_v1_6/beta", "shape": [6272], "dtype": "float32"}, {"name": "batch_normalization_v1_6/moving_mean", "shape": [6272], "dtype": "float32"}, {"name": "batch_normalization_v1_6/moving_variance", "shape": [6272], "dtype": "float32"}, {"name": "conv2d_24/kernel", "shape": [5, 5, 128, 64], "dtype": "float32"}, {"name": "conv2d_24/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_25/kernel", "shape": [5, 5, 64, 1], "dtype": "float32"}, {"name": "conv2d_25/bias", "shape": [1], "dtype": "float32"}, {"name": "dense_24/kernel", "shape": [784, 4096], "dtype": "float32"}, {"name": "dense_24/bias", "shape": [4096], "dtype": "float32"}, {"name": "dense_25/kernel", "shape": [4096, 6272], "dtype": "float32"}, {"name": "dense_25/bias", "shape": [6272], "dtype": "float32"}]}]}