{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.1.2", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_91", "layers": [{"class_name": "Dense", "config": {"name": "dense_139", "trainable": true, "batch_input_shape": [null, 2], "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_140", "trainable": true, "dtype": "float32", "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Reshape", "config": {"name": "reshape_103", "trainable": true, "dtype": "float32", "target_shape": [1, 32, 32]}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_149", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_150", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_151", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_152", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "Reshape", "config": {"name": "reshape_104", "trainable": true, "dtype": "float32", "target_shape": [1, 32]}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_transpose_149/kernel", "shape": [1, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_transpose_149/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_transpose_150/kernel", "shape": [1, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_transpose_150/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_transpose_151/kernel", "shape": [1, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_transpose_151/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_transpose_152/kernel", "shape": [1, 3, 1, 32], "dtype": "float32"}, {"name": "conv2d_transpose_152/bias", "shape": [1], "dtype": "float32"}, {"name": "dense_139/kernel", "shape": [2, 256], "dtype": "float32"}, {"name": "dense_139/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_140/kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "dense_140/bias", "shape": [1024], "dtype": "float32"}]}]}