{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.1.2", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_8", "layers": [{"class_name": "Model", "config": {"name": "model_24", "layers": [{"name": "input_25", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128], "dtype": "float32", "sparse": false, "name": "input_25"}, "inbound_nodes": []}, {"name": "dense_63", "class_name": "Dense", "config": {"name": "dense_63", "trainable": true, "dtype": "float32", "units": 512, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_25", 0, 0, {}]]]}, {"name": "dense_64", "class_name": "Dense", "config": {"name": "dense_64", "trainable": true, "dtype": "float32", "units": 512, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_63", 0, 0, {}]]]}, {"name": "dense_65", "class_name": "Dense", "config": {"name": "dense_65", "trainable": true, "dtype": "float32", "units": 512, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_64", 0, 0, {}]]]}], "input_layers": [["input_25", 0, 0]], "output_layers": [["dense_65", 0, 0]]}}, {"class_name": "Model", "config": {"name": "model_25", "layers": [{"name": "input_26", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 512], "dtype": "float32", "sparse": false, "name": "input_26"}, "inbound_nodes": []}, {"name": "dense_66", "class_name": "Dense", "config": {"name": "dense_66", "trainable": true, "dtype": "float32", "units": 512, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_26", 0, 0, {}]]]}, {"name": "dense_67", "class_name": "Dense", "config": {"name": "dense_67", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_66", 0, 0, {}]]]}, {"name": "dense_68", "class_name": "Dense", "config": {"name": "dense_68", "trainable": true, "dtype": "float32", "units": 512, "activation": "elu_plus_one_plus_epsilon", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_66", 0, 0, {}]]]}, {"name": "dense_69", "class_name": "Dense", "config": {"name": "dense_69", "trainable": true, "dtype": "float32", "units": 8, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_66", 0, 0, {}]]]}, {"name": "concatenate_12", "class_name": "Concatenate", "config": {"name": "concatenate_12", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["dense_67", 0, 0, {}], ["dense_68", 0, 0, {}], ["dense_69", 0, 0, {}]]]}], "input_layers": [["input_26", 0, 0]], "output_layers": [["concatenate_12", 0, 0]]}}]}}, "training_config": {"loss": "loss_func", "metrics": [], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 4.999999873689376e-06, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "dense_63/kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "dense_63/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_64/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "dense_64/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_65/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "dense_65/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_66/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "dense_66/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_67/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "dense_67/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_68/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "dense_68/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_69/kernel", "shape": [512, 8], "dtype": "float32"}, {"name": "dense_69/bias", "shape": [8], "dtype": "float32"}]}]}